Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
/*
    A simple MPPT controller with non-canonical design, developed By Evgeniy Evstratov, Autumn 2022.

    This Solar controller is being developed in these dark times when russia is destroying energetic system of my country and has already caused full-scale blackout.

    The project is intended as LOW-COST simple low power MPPT device to:
    - be affordable (very cheap MCU, small and simple scheme, *NO CURRENT SENSOR);
    - get maximum solar power generation in cloudy and winter weather (proper work specifically in low power range: starting from 0.01 A).
        -- allow using high voltage panels for low-voltage devices in such conditions when very small amount of solar energy can be generated (e.g. using 18v panel to charge a smartphone powerbank).

    Principle of work: according to solar panels voltage/current curves at very most part of the range the maximum power point (MPPT) is at around 80% of open circuit voltage (named 'raw voltage' here).
    So with certain scheme it's possible to measure (almost)open-circuit voltage (with minimal load) and track optimal mode without need of a current sensor.

    Basic scheme description in words:
        1. solar panel should be connected via diode (shottky SR840 is used in the prototype).
        2. input("high voltage" and "gnd") is connected to linear voltage stabilizer and minimal(!) required ceramic capacitor (0.1 - 0.15uf):
            0.15uf cap and "LP2950CZ-3.3G ON" stabilizer are used in the prototype.
        3. linear stabilizer has output ceramic capacitor (used 2.2uf in the prototype) and is connected as the PIC MCU power supply;
            * no mini buck converter can be used instead due to it's high input capacitance;
        4. one N-channel mosfet connects a large buffer capacitor between "high voltage" and "gnd" and occassionally disconnects it to measure open circuit voltage;
            * required PULLUP EXTERNAL resistor (used 200kOhm) - pull to stabilizer's voltage.
            heavy 5x 1000uf 35v LOW ESR capacitors are used in the prototype.
        5. second N-channel mosfet connects an output circuit (inductor+diode+capacitor) between "high voltage" and "gnd" and is being PWMed;
            * required PULLDOWN EXTERNAL resistor (used 200kOhm) - pull to "gnd".
            inductor is around 22uh - 47uh (in currently tested prototype 47uh is used);
            recommended capacitor is at least 2000uf (in currently tested prototype 2000uf is used);
        6. a calculated voltage divider between "high voltage" and "gnd" is connected to PIC MCU's pin with ADC channel:
            so that maximum possible voltage is <= nominal voltage of linear stabilizer;
            3.3kOhm / 20kOhm are used in prototype, I'd recommend to not exceed total resistance around 1kOhm per 1v nominal of solar panel;
        7. mosfets used in prototype are "IRLZ34N" - pretty low input capacitance, proper DS opening at 3.3v;
        8. with this minimym the output is not regulated so it can reach up to "opn circuit voltage" of the solar panel connected,
            as a very simple voltage limiter - a buck converter can be used;

    Output voltage/feedback: it's planned to implement feedback for output voltage limiting with an optocoupler and a comparator;



    Efficiency notes:
        - prototype has shown efficieny (output RMS power / input RMS power) from around 70 to 92% depending on voltage delta between an MPPT point and target output voltage;
        - efficieny was measured with not expensive equipment in limited environment;
        - used 18v panel (with typical MPPT around 15 ... 18v);
        - with plain powerbank as output ("consumed" voltage 4.5 ... 5.2v) deltaV is more than 10 volts and measured efficiency was around 75%;
        - with output 11.4v (same powerbank but luckily triggered to "stabilize at 12V QC mode" and apparently dropping it's buck cycles to maintain that)
            deltaV was around 4V and measured efficiency was 92.5%.
        - presumably higher voltage linear stabilizer (5v, more = not allowed for PIC) could do better (at least with some other mosfets) - this is to be tested;
        - Miller Effect: wasn't observed in prototype with my testing in artificial environment (tested single output driving pin vs dual output driving pin at 3.3v MCU voltage)
            * however it was tested with output voltages from 2v to 4v, and the effect could be noticed at higher output voltages - this is to be tested;
            * mosfets with larger parasitic capacitance could defenitely require doubled/tripled MCU output pin to drive them at high frequencies;
            * PIC16F676 could be easily adapted to use entire portB (6 pins) for mosfet driving;
            * mosfet that connects capacitors is rarely triggered so it can (and should) be more powerful (lower RdsON) - planned to test IRL2203 for this;

    Pulsation notes:
        - output voltage pulsations looked good for current FW version although they were evaluated with simple testers (I don't have an oscilloscope);
        - increasing capacitance (both buffer and output caps) should smooth pulsations very well (partly tested);
        - capacitance can be smaller or bigger than in prototype described above, suggestions for buffer and output caps are:
            -- minimum: 1000uf (buffer), 2000uf(output);
            -- recommended: 3000uf+ (buffer), 5000uf+(output);
        - for future addition of output voltage limitation feedback there are expected to be rare more substantial drop-offs (when reaching voltage limit) for algorithm/code that I have in mind;

    More output voltage limiting notes:
        - powerbank:
            - tested powerbank can be tricked to trigger QC mode and rise voltage - when it's connected it "requests" higher voltage while pushing no substantial load
            and the actual voltage can be rising at the moment so powerbank considers that everything is according to plan and accepts it;
            - if voltage manages to rise higher than powerbank's limit - it will shut down and won't charge;
            - plain buck converter (when added after output) is apparenty fully "opened" and acts as a minor resistance (inductor+mosfet) with it's input and output voltages being almost equal;

    Adding to existing solar (battery + PWM charger) system:
        - it's assumed that this controller can be simply connected in series between solar panel and thirdparty "PWM Solar controller",
        although it's not tested and I'm not 100% that a PWM controller would handle this without any issues
        (specifically when charging is done and PWM controller's input voltage goes up);

