Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
    Partial shading: use cases of this project don't assume optimal work with significant partial shading (no "full scan" is implemented, nor it's possible with such scheme).
    Personal notes:
        *- although I believe it will work pretty well with real-world partial shading cases;
        *- partial shading isn't a problem that needs solving (except for very specific forced cases) as solar panels as technology simply doesn't assume partial shading - so just do proper installation / consider proper sizes to avoid any partial shading;
*/

#define _XTAL_FREQ 4000000

#include <xc.h>

//BEGIN CONFIG
#pragma config FOSC = INTRCIO
#pragma config WDTE = OFF // Watchdog Timer Enable bit (WDT enabled)
#pragma config PWRTE = OFF // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = OFF // MCLR internal, use pin as IO
#pragma config BOREN = ON // Brown-out Reset Enable bit (BOR enabled)
#pragma config CP = OFF // Flash Program Memory Code Protection bit (Code protection off)
#pragma config CPD = OFF // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
//END CONFIG

#define AUX_STRINGIFY_INTERNAL(foo) #foo
#define AUX_STRINGIFY(foo) AUX_STRINGIFY_INTERNAL(foo)

// manual params
#define PROJ_TMR_PRESCALE (0b111) // x256

// pins / topology
#define PROJ_BIT_IN_ADC_VOL GPIO2 // voltage divider for power line - calculate so that it maxes out to chip PSU level (used 3.3 regulator)
#define PROJ_BIT_IN_BTN GPIO4 // button press (see PROJ_BTN_DELAY) adjusts percentage level of raw voltage to hold
#define PROJ_BIT_OUT_CAP GPIO1 // N-channel mosfet controlling power capacitor, PULLUP external resistor 200k
#define PROJ_BIT_OUT_OUT GPIO0 // N-channel mosfet (or 'enable' pin on output line) controlling output line, PULLDOWN external resistor
#define PROJ_BIT_OUT_DEBUG GPIO5 // output led, blinks wiht 0.1s intervals (0.1s ON / 0.1s OFF)

#define PROJ_BIT_NUM_OUT_OUT 0 // GPIO0 (PROJ_BIT_OUT_OUT)
#define PROJ_BIT_NUM_OUT_CAP 1 // GPIO1 (PROJ_BIT_OUT_CAP)
#define PROJ_BIT_NUM_IN_BTN 4 // GPIO4 (PROJ_BIT_IN_BTN)
#define PROJ_BIT_NUM_OUT_DEBUG 5 // GPIO5 (PROJ_BIT_OUT_DEBUG)

#define PROJ_ADC_CH_VOL 2 // AN2 (GPIO2)

// ADC allows up to 10k resistance, thus for 5vols it's NOT LESS than 0.5ma current for each ADC channel
#define PROJ_ADC_ADCS 0b010 // conversion time
#define PROJ_ADC_TIME_US 8

#define PROJ_THR_START 204 // initial threshold percentage (x/255) of raw(no load) voltage to hold
#define PROJ_THR_MIN 199 // min, including (round-robin)
#define PROJ_THR_MAX 219 // max, including (round-robin)
#define PROJ_THR_DIFF_LARGER_DROPOUT 2 // thr_hi - adcval >= 'this' ? larger power drop
#define PROJ_THR_DIFF_INSTANT_DROPOUT 6 // thr_hi - adcval >= 'this' ? full power drop
#define PROJ_THR_STEP 5 // percantage to add at button press
#define PROJ_BTN_DELAY 4 // amount of 100ms periods for button state, at pre-last iteration triggers button action

#define PROJ_PWR_LEVEL_MAX 26

#define PROJ_PWR_RISE_DELAY 3 // number of consequent times for ADC checks to trigger single rise

volatile GPIObits_t gp_shadow;

uint8_t app_flags;
#define APP_FLAG_LAST_BTN_ON 0
#define APP_FLAG_TMP_BTN_ON 1

uint8_t app_btn_timer;
uint8_t app_debug_blinks;
uint8_t app_rise_counter;

#define PROJ_OUT_FET_PINS_MASK (1 << PROJ_BIT_NUM_OUT_OUT)
#define PROJ_OUT_FET_PINS_NEG_MASK (~PROJ_OUT_FET_PINS_MASK)

uint8_t dirty_flags;
#define APP_DIRTY_FLAG_1000MS 0 // bit numbers. if another 1000ms have passed and requires processing
#define APP_DIRTY_FLAG_150MS 1
#define APP_DIRTY_FLAG_THRS 2 // if thresholds need recalculation
#define APP_DIRTY_FLAG_NOP1 3
#define APP_DIRTY_FLAG_NOP2 4

#define PROJ_INITER_128MS_S0 2 // 128 in steps by 64
#define PROJ_INITER_1S_S1 8 // 1s in steps by 128

/*
    OSSCAL deviation: on my PIC it was x1.65 difference between min and max frequency (osccal 0x00-min freq and 0xFC-max freq)
    with typical calibrated values checked on 5 pics being around 0x24 - 0x44, so setting osccal to max value is assumed
    to multiply actual frequency by around x1.5 (comparing to 4mhz spec).
*/


// relies on active bank 0
#define PROJ_ASSIGN_OUT_1 \
    asm("movf _gp_shadow,w"); \
    asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK)); \
    asm("movwf 5"); /* assign GPIO */ \
    asm("movwf _gp_shadow"); /* refresh gp_shadow */
#define PROJ_ASSIGN_OUT_0 \
    asm("movf _gp_shadow,w"); \
    asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK)); \
    asm("movwf 5"); /* assign GPIO */ \
    asm("movwf _gp_shadow"); /* refresh gp_shadow */



// local isr vars
uint8_t isr_ctr_128_s0 = PROJ_INITER_128MS_S0;
uint8_t isr_ctr_1s_s1 = PROJ_INITER_1S_S1;

// isr cache
uint8_t temp_w;
uint8_t temp_status;
//

asm("global _isr");
void isr(void) __at(0x0004)
{
    asm("movwf _temp_w");
    asm("swapf 3,w");
    asm("movwf _temp_status");
    //asm("bcf 3,5"); // select bank 0 - may be not necessary in isr
    // context saved

    PROJ_ASSIGN_OUT_0 // we actually should never get here as we catch upcoming timer interrupt and process manually
    // ++64ms
    asm("decfsz _isr_ctr_128_s0,f"); // --ctr, test
    asm("goto labe_isr_out");
        asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_150MS));
        asm("movlw " AUX_STRINGIFY(PROJ_INITER_128MS_S0));
        asm("movwf _isr_ctr_128_s0"); // reinit ctr
        asm("decfsz _isr_ctr_1s_s1,f"); // --ctr, test
        asm("goto labe_isr_out");
            asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_1000MS));
            asm("movlw " AUX_STRINGIFY(PROJ_INITER_1S_S1));
            asm("movwf _isr_ctr_1s_s1"); // reinit ctr
    asm("labe_isr_out:");
    asm("bcf 11,2"); // INTCONbits.T0IF = 0; // regardless of current bank

    // context restoring
    asm("swapf _temp_status,w");
    asm("movwf 3"); // recover status
    asm("swapf _temp_w,f");
    asm("swapf _temp_w,w"); // recover w
    //
    asm("retfie"); // compiler auto-generates "return" here, nevermind at the moment, just use explicit retfie.
}

// >= 3 tacts: 3 or 8 or 10
#define PROJ_INLINED_ISR_REPLACEMENT(lbl_name) \
    asm("decfsz _isr_ctr_128_s0,f"); \
    asm("goto "lbl_name); \
        asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_150MS)); \
        asm("movlw " AUX_STRINGIFY(PROJ_INITER_128MS_S0)); \
        asm("movwf _isr_ctr_128_s0"); \
        asm("decfsz _isr_ctr_1s_s1,f"); \
        asm("goto "lbl_name); \
            asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_1000MS)); \
            asm("movlw " AUX_STRINGIFY(PROJ_INITER_1S_S1)); \
            asm("movwf _isr_ctr_1s_s1"); \
    asm(""lbl_name":");

// >= 5 tacts: 5 or 5+(3 or 8 or 10) == 5 or 8 or 13 or 15 tacts
#define PROJ_CATCH_AVOID_ISR(lbl_name_exit, n_timer_periods) \
    asm("movlw " AUX_STRINGIFY(256-n_timer_periods)); \
    /* asm("bcf	3,5"); select bank 0 (for tmr0 reg) */ \
    asm("subwf 1,w"); \
    asm("skipc"); /* c == no borrow -> timer is lower than constant specified */ \
    asm("goto "lbl_name_exit); \
    asm("clrf 1"); /* TMR0 = 0; avoid ISR */ \
    PROJ_INLINED_ISR_REPLACEMENT(lbl_name_exit)

