Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
/*
uint8_t RunADC_8bit(uint8_t ch) {
    // ch=0..3
    ADCON0 = 0x01 | (uint8_t)(ch << 2);// ADON=1 + set channel
    __delay_us(PROJ_ADC_TIME_US + 16); // only needed on re-acquisition
    ADCON0bits.GO_DONE = 1;
    __delay_us(PROJ_ADC_TIME_US);
    while(ADCON0bits.GO_DONE) {
        // w8
    }
    return ADRESH;
}

// runs adc on PROJ_ADC_CH_VOL, result is in ADRESH (30); relies on bank 0 being selected
void fast_RunADC_8() {
    asm("movlw " AUX_STRINGIFY((1 | (PROJ_ADC_CH_VOL << 2))));
    asm("movwf 31"); // ADCON0 = w
    asm("bsf 31,1"); // ADCON0bits.GO_DONE = 1;
    //asm("nop"); asm("nop"); // wait PROJ_ADC_TIME_US
    asm("labe_fast_RunADC_8__cycle:");
    asm("btfsc 31,1"); // while(ADCON0bits.GO_DONE)
    asm("goto labe_fast_RunADC_8__cycle");
    // asm("return"); // auto generated
}
//*/

#define PROJ_ADC_SETUP__WHEN_BANK0() \
    asm("movlw " AUX_STRINGIFY((1 | (PROJ_ADC_CH_VOL << 2)))); \
    asm("movwf 31"); // ADCON0 = w

#define PROJ_ADC_START() \
    asm("bsf 31,1"); // ADCON0bits.GO_DONE = 1;

#define PROJ_ADC_WAIT(lbl_name) \
    asm(""lbl_name":"); \
    asm("btfsc 31,1"); /* while(ADCON0bits.GO_DONE) */ \
    asm("goto "lbl_name);

// similar to fast_RunADC_8; erases tmp_ctr and tmp_ctr2 vars
void fast_RunADC_8_rising() {
    asm("movlw 5");
    asm("movwf _tmp_ctr"); // tmp_ctr = 5
    asm("clrf _tmp_ctr2"); // last result
    asm("labe_fast_RunADC_8_rising__rising_cycle:");
    PROJ_ADC_START()
    PROJ_ADC_WAIT("labe_fast_RunADC_8_rising__wait")
    // got result in '30' (ADRESH)
    asm("movf 30,w");
    asm("addlw 254"); // w = adc - 2
    asm("subwf _tmp_ctr2,w"); // w = prev_adc - (adc - 2) ;; trigger borrow flag
    asm("skipnc"); // skip next if (borrow -> still rising)
    asm("return");
    // still rising
    asm("decfsz _tmp_ctr");
    asm("goto labe_fast_RunADC_8_rising__continue");
    asm("return");

    asm("labe_fast_RunADC_8_rising__continue:");
    asm("movf 30,w"); // refresh last result (tmp_ctr2)
    asm("movwf _tmp_ctr2");
    asm("goto labe_fast_RunADC_8_rising__rising_cycle");
}


// TODO multiplication will be optimized to reduce delay, likely in one of two ways (if calibration is fully discarded):
// 1. shorter multiply-by-constant code
// 2. mapped table (addwf 2,...; retlw ... retlw) with around 220-230 bytes of program memory
// another option is several predefined multiply-by-constant blocks with combined tabled jump to required one
uint8_t fast_mul_8x8_res_h;
uint8_t fast_mul_8x8_res_l;
uint8_t fast_mul_8x8_input1; // input2 is w
void fast_mul_8x8() {
    asm("clrf _fast_mul_8x8_res_h");
    asm("clrf _fast_mul_8x8_res_l");

    asm("btfss _fast_mul_8x8_input1,7");
    asm("goto labe_fast_mul_8x8__post7");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");

        asm("clrc"); // post 7, pre 6
        asm("rlf _fast_mul_8x8_res_l,f");
        asm("rlf _fast_mul_8x8_res_h,f");
    asm("labe_fast_mul_8x8__post7:");
    //
    asm("btfss _fast_mul_8x8_input1,6");
    asm("goto labe_fast_mul_8x8__post6");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post6:");
            asm("clrc"); // post 6, pre 5
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,5");
    asm("goto labe_fast_mul_8x8__post5");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post5:");
            asm("clrc"); // post 5, pre 4
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,4");
    asm("goto labe_fast_mul_8x8__post4");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post4:");
            asm("clrc"); // post 4, pre 3
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,3");
    asm("goto labe_fast_mul_8x8__post3");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post3:");
            asm("clrc"); // post 3, pre 2
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,2");
    asm("goto labe_fast_mul_8x8__post2");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post2:");
            asm("clrc"); // post 2, pre 1
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,1");
    asm("goto labe_fast_mul_8x8__post1");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post1:");
            asm("clrc"); // post 1, pre 0
            asm("rlf _fast_mul_8x8_res_l,f");
            asm("rlf _fast_mul_8x8_res_h,f");
    asm("btfss _fast_mul_8x8_input1,0");
    asm("return"); // asm("goto labe_fast_mul_8x8__post0");
        asm("addwf _fast_mul_8x8_res_l,f");
        asm("skipnc");
        asm("incf _fast_mul_8x8_res_h");
    asm("labe_fast_mul_8x8__post0:");
    // asm("return"); // auto generated
}

uint8_t g_thr = PROJ_THR_START;
uint8_t last_raw_adc_val = 0;
uint8_t thr_min;
uint8_t thr_hi; // high level voltage threshold
uint8_t thr_lo; // low/instant-off voltage threshold
uint8_t pwr_level = 0; // active power level - the higher - the lower is inductor frequency. zero is disconnected
uint8_t tmp_ctr; // temporary
uint8_t tmp_ctr2; // temporary

asm("global _aux_delay_generic");
void aux_delay_generic() {
    // 2(call) + ... + 2(return)
    asm("labe_aux_delay_20:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_16:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_12:"); asm("fcall labe_aux_delay_4");
    asm("labe_aux_delay_8:");  asm("fcall labe_aux_delay_4");
    asm("return");
    asm("labe_aux_delay_7:"); asm("nop");
    asm("labe_aux_delay_6:"); asm("nop");
    asm("labe_aux_delay_5:"); asm("nop");
    asm("labe_aux_delay_4:");
    // 'return' is auto-geerated
}
#define AUX_DELAY_1 asm("nop");
#define AUX_DELAY_2 asm("nop"); asm("nop");
#define AUX_DELAY_3 asm("nop"); asm("nop"); asm("nop");

#define AUX_DELAY_4 asm("fcall labe_aux_delay_4");
#define AUX_DELAY_5 asm("fcall labe_aux_delay_5");
#define AUX_DELAY_6 asm("fcall labe_aux_delay_6");
#define AUX_DELAY_7 asm("fcall labe_aux_delay_7");
#define AUX_DELAY_8 asm("fcall labe_aux_delay_8");
#define AUX_DELAY_9      asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_10     asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_11     asm("fcall labe_aux_delay_4"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_12 asm("fcall labe_aux_delay_12");
#define AUX_DELAY_13     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_14     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_15     asm("fcall labe_aux_delay_8"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_16 asm("fcall labe_aux_delay_16");
#define AUX_DELAY_17     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_18     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_19     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_20     asm("fcall labe_aux_delay_12"); asm("fcall labe_aux_delay_8");
#define AUX_DELAY_21     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_22     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_23     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_24     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_8");
#define AUX_DELAY_25     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_5");
#define AUX_DELAY_26     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_6");
#define AUX_DELAY_27     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_7");
#define AUX_DELAY_28     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_8");

#define AUX_DELAY_32     asm("fcall labe_aux_delay_16"); asm("fcall labe_aux_delay_16");
#define AUX_DELAY_36     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_16");
#define AUX_DELAY_40     asm("fcall labe_aux_delay_20"); asm("fcall labe_aux_delay_20");


void apply_pwr_level() __at(0x0040)
{
    // asm("bcf 3,5"); // ensure bank0 selected
    asm("movf _pwr_level,w");
    asm("addwf 2,f"); // PCL += pwr_level: tabled jump

    // TODO OPT MIGHT take advantage of jump to offset*2 to avoid intermediate jumps in some cases

    asm("goto labe_apply_pwr_level__zero"); // 0
    asm("goto labe_apply_pwr_level__d2_c1"); // 1
    asm("goto labe_apply_pwr_level__d2_c2_long"); // 2
    asm("goto labe_apply_pwr_level__d2_c2_short"); // 3
    asm("goto labe_apply_pwr_level__d3_c1"); // 4
    asm("goto labe_apply_pwr_level__d2c1__d3c1"); // 5
    asm("goto labe_apply_pwr_level__d3c1__d3c1"); // 6
    asm("goto labe_apply_pwr_level__d3_c2"); // 7
    asm("goto labe_apply_pwr_level__d3_c3"); // 8
    asm("goto labe_apply_pwr_level__d3_c4"); // 9
    asm("goto labe_apply_pwr_level__d3_c5"); // 10
    asm("goto labe_apply_pwr_level__d3_c7"); // 11
    asm("goto labe_apply_pwr_level__d3_c9"); // 12
    asm("goto labe_apply_pwr_level__d3_c12"); // 13
    asm("goto labe_apply_pwr_level__d3_c15"); // 14
    asm("goto labe_apply_pwr_level__d3_c19"); // 15
    asm("goto labe_apply_pwr_level__d3_c24"); // 16
    asm("goto labe_apply_pwr_level__d4_c18"); // 17
    asm("goto labe_apply_pwr_level__d5_c15"); // 18
    asm("goto labe_apply_pwr_level__d6_c12"); // 19
    asm("goto labe_apply_pwr_level__d7_c10"); // 20
    asm("goto labe_apply_pwr_level__d9_c8"); // 21
    asm("goto labe_apply_pwr_level__d12_c6"); // 22
    asm("goto labe_apply_pwr_level__d15_c5"); // 23
    asm("goto labe_apply_pwr_level__d18_c4"); // 24
    asm("goto labe_apply_pwr_level__d21_c3"); // 25
    asm("goto labe_apply_pwr_level__max"); // 26
    // end table
    // ----- 0
    asm("labe_apply_pwr_level__zero:");
        PROJ_ASSIGN_OUT_0
        asm("return");

    // ----- duration 2
    asm("labe_apply_pwr_level__d2_c1:");
        asm("movf _gp_shadow,w");
        asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("movwf _gp_shadow"); // refresh gp_shadow
        asm("return");

    asm("labe_apply_pwr_level__d2_c2_long:");
        asm("movf _gp_shadow,w");
        asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_10
        // TODO SIZE: can reduce delay and just jump to labe_apply_pwr_level__d2_c1
        asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("movwf _gp_shadow"); // refresh gp_shadow
        asm("return");

    asm("labe_apply_pwr_level__d2_c2_short:");
        asm("movf _gp_shadow,w");
        asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        AUX_DELAY_4
        // TODO SIZE: can reduce delay and just jump to labe_apply_pwr_level__d2_c1
        asm("iorlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_MASK));
        asm("movwf 5"); /* assign GPIO: output = 1 */
        asm("andlw " AUX_STRINGIFY(PROJ_OUT_FET_PINS_NEG_MASK));
        asm("movwf 5"); /* assign GPIO: output = 0 */
        asm("movwf _gp_shadow"); // refresh gp_shadow
        asm("return");

