Nonoum/LP_MPPT_PIC12F675/pic12f675/main.c
                asm("bsf _gp_shadow," AUX_STRINGIFY(PROJ_BIT_NUM_OUT_CAP));
                asm("movf _gp_shadow,w");
                asm("movwf 5"); // attach capacitor
                asm("goto labe_main__cycle"); // enough delaying work - to cycle start
            asm("labe_main__1000ms_non_dirty:");


            // cascade nops - used together (nop2 is nested in nop1 to minimize cycle path delay)
            asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
            asm("goto labe_main__nop1_non_dirty");
                asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));
                asm("goto labe_main__nop2_non_dirty");
                    asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));
                    asm("goto labe_main__cycle");
                asm("labe_main__nop2_non_dirty:");
                //
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
                asm("goto labe_main__cycle");
            asm("labe_main__nop1_non_dirty:");


            asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_THRS));
            asm("goto labe_main__thr_non_dirty");
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_THRS));
                asm("movlw " AUX_STRINGIFY(PROJ_PWR_RISE_DELAY)); // w = PROJ_PWR_RISE_DELAY
                asm("movwf _app_rise_counter"); // app_rise_counter = PROJ_PWR_RISE_DELAY

                asm("movf _last_raw_adc_val,w"); // TODO input1 can be union with last_raw_adc_val to save 2 commands
                asm("movwf _fast_mul_8x8_input1");
                asm("movf _g_thr,w");
                asm("fcall _fast_mul_8x8");
                asm("movf _fast_mul_8x8_res_h,w");
                asm("movwf _thr_hi"); // thr_hi = last_raw_adc_val * g_thr / 256
                //
                asm("subwf _thr_min,w"); // w(thr_hi) = thr_min - w ; if borrow - no action
                asm("skipnc"); // skip next if borrow
                asm("addwf _thr_hi,f"); // thr_hi += (thr_min - thr_hi)
                //
                asm("movlw " AUX_STRINGIFY(PROJ_THR_DIFF_INSTANT_DROPOUT));
                asm("subwf _thr_hi,w"); // w = thr_hi - PROJ_THR_DIFF_INSTANT_DROPOUT
                asm("movwf _thr_lo");
                asm("goto labe_main__cycle"); // enough delaying work - to cycle start
            asm("labe_main__thr_non_dirty:");


            asm("btfss _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_150MS));
            asm("goto labe_main__150ms_non_dirty");
                asm("bcf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_150MS));
                //asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP1));
                //asm("bsf _dirty_flags," AUX_STRINGIFY(APP_DIRTY_FLAG_NOP2));
                //asm("bcf 3,5"); // ensure bank0 selected
                asm("movlw " AUX_STRINGIFY(PROJ_PWR_RISE_DELAY)); // w = PROJ_PWR_RISE_DELAY
                asm("movwf _app_rise_counter"); // app_rise_counter = PROJ_PWR_RISE_DELAY
                //
                asm("bcf _app_flags," AUX_STRINGIFY(APP_FLAG_TMP_BTN_ON));
                asm("btfss 5," AUX_STRINGIFY(PROJ_BIT_NUM_IN_BTN)); // GPIObits.PROJ_BIT_IN_BTN
                asm("bsf _app_flags," AUX_STRINGIFY(APP_FLAG_TMP_BTN_ON)); // app.bits.tmp_btn_on = (0 == GPIObits.PROJ_BIT_IN_BTN);

                asm("clrw");
                asm("btfsc _app_flags," AUX_STRINGIFY(APP_FLAG_TMP_BTN_ON));
                asm("addlw 1");
                asm("btfsc _app_flags," AUX_STRINGIFY(APP_FLAG_LAST_BTN_ON));
                asm("addlw 255");
                // now W is zero if APP_FLAG_TMP_BTN_ON==APP_FLAG_LAST_BTN_ON
                asm("iorlw 0"); // test for zero
                asm("skipnz");
                asm("goto labe_main__btn_unchanged");
                    // last_btn_on = tmp_btn_on
                    asm("bcf _app_flags," AUX_STRINGIFY(APP_FLAG_LAST_BTN_ON));
                    asm("btfsc _app_flags," AUX_STRINGIFY(APP_FLAG_TMP_BTN_ON));
                    asm("bsf _app_flags," AUX_STRINGIFY(APP_FLAG_LAST_BTN_ON));
                    // app_btn_timer = 0
                    asm("clrf _app_btn_timer");
                    asm("goto labe_main__btn_timer_updated");
                asm("labe_main__btn_unchanged:");
                asm("movlw " AUX_STRINGIFY(PROJ_BTN_DELAY));
                asm("subwf _app_btn_timer,w");
                asm("skipc");
                asm("incf _app_btn_timer,f"); // increment, if not max
                //
                asm("labe_main__btn_timer_updated:");
                //
                //
                asm("btfss _app_flags," AUX_STRINGIFY(APP_FLAG_LAST_BTN_ON));
                asm("goto labe_main__btn_processed");
                // if last_btn_on
                asm("movlw " AUX_STRINGIFY(PROJ_BTN_DELAY - 1));
                asm("subwf _app_btn_timer,w");
                asm("skipz");
                asm("goto labe_main__btn_processed");
                // if btn_timer == (PROJ_BTN_DELAY-1)
                { // handle btn
                    g_thr += PROJ_THR_STEP;
                    if(g_thr > PROJ_THR_MAX) {
                        g_thr = PROJ_THR_MIN;
                    }
                    if(! app_debug_blinks) {
                        uint8_t tmp = g_thr - PROJ_THR_MIN;
                        app_debug_blinks = 1;
                        // instead of heavy division operation
                        while(tmp) {
                            tmp -= PROJ_THR_STEP;
                            ++app_debug_blinks;
                        }
                        app_debug_blinks <<= 1;
                    }
                }
                asm("labe_main__btn_processed:");

                if(app_debug_blinks) {
                    --app_debug_blinks;
                    gp_shadow.PROJ_BIT_OUT_DEBUG = ! gp_shadow.PROJ_BIT_OUT_DEBUG; // invert led
                    GPIObits = gp_shadow;
                }
            asm("labe_main__150ms_non_dirty:");
            asm("bcf 3,5"); // ensure bank0 selected
        asm("goto labe_main__cycle");
} //
